app/Models/BookModel.php

    public function getBooks()
    {
        return $this->findAll();
---
SELECT *
FROM `books`